tutorials/rhoPimpleFoam/angledDuct/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho PCG
    {
        preconditioner   DIC;
        tolerance        1e-05;
        relTol           0;
    };
    U PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0.1;
    };
    UFinal PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    p PCG
    {
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0.01;
    };
    pFinal PCG
    {
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0;
    };
    h PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0.1;
    };
    hFinal PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    R PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    k PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    epsilon PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
    omega PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
}

PIMPLE
{
    nOuterCorrectors  50;
    nCorrectors       1;
    nNonOrthogonalCorrectors 0;
    momentumPredictor yes;

    pMin            pMin [1 -1 -2 0 0 0 0] 1000;
}

relaxationFactors
{
    U    0.7;
    p    0.3;
    rho  0.05;
    h    0.7;
    k    0.7;
    omega 0.7;
}

// ************************************************************************* //
